// app 静态配置总闸
// 如果有动态配置项在这里，那么设置的就是默认的初始状态值
// 如需配置服务器地址相关，请移步 ./sso.js

// ************************** app 启动模式 ******************************
// 可供选项: production / demo / developing
// production:产品模式
//  - 此模式下的 app 即为待打包给客户交付的产品。
// demo:演示模式
//  - 此模式下的页面路由是一些与真实逻辑不相干的主功能页面，意在给客户展示效果，先行体验。
// developing:开发者模式
//  - 此模式下首页底部导航栏将多一条“开发者中心”路由，去往模板页展示效果预览页。
// **********************************************************************
const mode = "demo"

// ************************** app 默认风格 ******************************
// 之后可以在应用内部动态修改，这里设置的是启动时的初始风格
// 默认为浅色风格
// **********************************************************************
const style = "light"

// ************************** app 是否启用路由切换时的动效 ******************************
// 这是一个静态配置项，暂时不支持动态配置
// **********************************************************************
const enableRouterAnimate = true



export { mode, style, enableRouterAnimate }
